package com.example.cookbook.data

import com.example.cookbook.data.model.Food
import com.example.cookbook.data.model.FoodCategory

object FoodDataProvider {
    val foodCategories = listOf(
        FoodCategory(1,"غذای ایرانی", "https://chishi.ir/wp-content/uploads/2019/10/ghorme-sabzi.jpg"),
        FoodCategory(2,"غذای فرنگی", "https://chishi.ir/wp-content/uploads/2020/01/bif-esteraganof.jpg"),
        FoodCategory(3,"غذای آسیای شرقی", "https://www.ghafaridiet.com/upload/article/1707428002.jpg"),
    )

    val foods = listOf(
        Food(
            name = "قرمه سبزی",
            foodCategoryId = 1,
            imageUrl = "https://chishi.ir/wp-content/uploads/2019/10/ghorme-sabzi.jpg",
            recipe = "خورش قورمه سبزی یکی از غذاهای سنتی و اصیل ایرانی است که نه تنها در میان ایرانیان بسیار محبوب است بلکه در خارج از ایران هم طرفداران بسیاری دارد. از محبوب ترین انواع خورش قورمه سبزی در مناطق مختلف ایران می توان به خورش قورمه سبزی تهرانی ، خورش قورمه سبزی گیلانی ، خورش قورمه سبزی جنوبی و خورش قورمه سبزی ترکی یا تبریزی اشاره کرد که از نظر مواد کمی با هم متفاوت هستند. برای مشاهده آموزش آشپزی کامل و مرحله به مرحله طرز تهیه خورش قورمه سبزی در ادامه با کوک بوک همراه باشید.\n" +
                    "برای تهیه قورمه سبزی خوشمزه، ابتدا لوبیا قرمز را از شب قبل خیس کنید تا نفخ آن گرفته شود. سپس پیاز را نگینی خرد کرده و با مقداری روغن و ادویه\u200Cها تفت دهید. گوشت را به قطعات مناسب برش داده و به پیاز اضافه کنید تا سرخ شود. پس از آبکش کردن لوبیا، آن را به همراه آب به مخلوط گوشت و پیاز اضافه کرده و اجازه دهید تا بپزند. سبزی خورشتی را سرخ کرده و به خورش اضافه کنید. در نهایت، چاشنی\u200Cها را به همراه لیمو عمانی افزوده و در دقایق پایانی، طعم خورش را با نمک و فلفل تنظیم کنید.\n" +
            "\n" + "مرحله ۱: آماده\u200Cسازی لوبیا\n" + "اولین اقدام برای تهیه قورمه سبزی خیساندن لوبیا قرمز می باشد. برای گرفتن نفخ لوبیا قرمز آن را داخل یک کاسه حاوی آب قرار دهید. توصیه ما این است که هر زمانی تصمیم گرفتید قورمه سبزی تهیه کنید از شب قبل لوبیا قرمز را بخیسانید.\n" +
            "\n" + "مرحله ۲: تعویض آب لوبیا\n" + "این کار علاوه بر اینکه نفخ لوبیا قرمز را می گیرد، باعث می شود که لوبیا نرم تر شود و به همین دلیل  زمان پخت آن کاهش یابد. در صورتی که بتوانید آب موجود در کاسه را دو تا سه باز تعویض کنید، نفخ لوبیا به طور کامل گرفته خواهد شد.\n" +
            "\n" + "مرحله ۳: تفت دادن پیاز و ادویه\u200Cها\n" + "پیاز را به صورت نگینی ریز خرد کنید و به همراه مقداری روغن مایع داخل قابلمه ای که برای پخت خورش در نظر گرفته اید بریزید. پیاز را کمی تفت دهید تا شفاف شود، سپس مقداری زردچوبه و در صورت تمایل فلفل سیاه به پیاز اضافه کنید و تفت دادن را ادامه دهید تا زمانی که ادویه ها کامل به خورد پیاز بروند.\n" +
            "\n" + "مرحله ۴: افزودن و تفت دادن گوشت\n" + "در این مرحله گوشت را پس از شستشو به صورت قورمه ای خرد کنید و به قابلمه خورش اضافه کنید. بهتر است قطعات گوشت خیلی درشت نباشند زیرا علاوه بر اینکه دیرتر پخته می شوند روی ظاهر خورش تاثیر منفی می گذارند.\n" +
            "\n" + "مرحله ۵: اضافه کردن لوبیا قرمز و آب\n" + "پس از اضافه کردن گوشت به پیاز ، آنرا به خوبی تفت دهید تا رنگ آن تغییر کند و کمی سرخ شود. پس از اینکه گوشت سرخ شد لوبیا قرمز را آبکشی کنید و به قابلمه اضافه کنید. لوبیا قرمز را یکی دو دقیقه تفت دهید، سپس سه لیوان آب به قابلمه اضافه کنید.\n" +
            "\n" + "مرحله ۶: پخت گوشت و لوبیا\n" + "حرارت زیر قابلمه را زیاد کنید تا آب به جوش بیاید، سپس آنرا ملایم تر کنید تا گوشت و لوبیا قرمز به آرامی بپزند. برای پخت گوشت و لوبیا قرمز حدود ۲ ساعت زمان نیاز است. در ادامه سبزی خورشتی را پس از پاک کردن و شستشو به صورت ساطوری خرد کنید.\n" +
            "\n" + "مرحله ۷: سرخ کردن سبزی خورشتی\n" + "سبزی خورشتی را به همراه مقداری روغن مایع در یک تابه جداگانه سرخ کنید. هر چقدر سبزی را بیشتر سرخ کنید رنگ قورمه سبزی شما تیره تر خواهد شد. پس از گذشت یک ساعت از پخت لوبیا و گوشت، سبزی را پس از سرخ کردن به قابلمه خورش اضافه کنید.\n" +
            "\n" + "مرحله ۸: افزودن چاشنی\u200Cها\n" + "در این مرحله می توانید لیمو عمانی ها را به همراه فلفل سیاه ، آبغوره و کمی آب نارنج به قابلمه اضافه کنید. یکی از نکات مهم در این مرحله این است که حتما لیمو عمانی ها را از وسط نصف کنید و تخمه های آن را خارج کنید.\n" +
            "\n" + "مرحله ۹: تنظیم نمک و آب خورش\n" + "تخمه های لیمو عمانی می توانند باعث تلخ شدن طعم خورش ما شوند. توصیه می کنیم نمک را پس از اینکه گوشت به طور کامل پخت به خورش اضافه کنید زیرا باعث می شود که گوشت دیرتر بپزد. در صورتی که آب خورش کم شده بود می توانید مقداری آب جوش اضافه کنید.\n" +
            "\n" + "مرحله ۱۰: تنظیم طعم و سرو\n" + "در ۱۵ دقیقه پایانی طعم خورش را بچشید و در صورت نیاز مقداری نمک، فلفل سیاه و انواع ادویه های دلخواه خود را اضافه کنید. پس از اینکه خورش به خوبی روغن انداخت، آنرا در ظرف خورشت خوری بکشید و به همراه برنج سرو کنید.\n" +
            "\n" + "نکات طرز تهیه قورمه سبزی\n" +
            "\n" + "روغن انداختن قورمه سبزی\n" + "یکی از فوت های و فن مهم در تهیه خورش قورمه سبزی این است که کاری کنید که خورش شما به خوبی روغن بیندازد. روغن انداختن قورمه سبزی علاوه بر اینکه ظاهر خورش را زیباتر می کند باعث می شود طعم بهتری را نیز تجربه کنید. نکته اول برای روغن انداختن قورمه سبزی همانطور که در بالا ذکر کردیم سرخ کردن سبزی خورشتی است.\n" +
                    "\n" +
                    "اگر سبزی خورشتی به خوبی سرخ شود خورش شما روغن بیشتری خواهد انداخت. نکته دوم هم این است که پس از اینکه گوشت و لوبیا قرمز پختند یک قطعه کوچک یخ به خورش اضافه کنید که باعث شوک به مواد خورش می شوند و به روغن انداختن خورش کمک می کند.\n" +
            "\n" + "سبزی مخصوص قورمه سبزی\n" + "«سبزی قورمه سبزی» به طور معمول متشکل از تره ، جعفری ، شنبلیله ، گشنیز و اسفناج می باشد که البته این ترکیب در شهرهای مختلف متفاوت است. مثلا در شهرهای جنوبی کشور سبزیجات معطر دیگری مثل سیر سبز و شوید نیز به ترکیب اصلی سبزی قورمه سبزی اضافه می شود.\n" +
                    "\n" +
                    "در استان آذربایجان هم به سبزی قورمه سبزی سبزیجاتی مثل ترخون اضافه می شود که باعث تند و تیزتر شدن طعم خورشت می شود. یکی از نکات مهم در مورد سبزی قورمه سبزی این است که توصیه می شود از شنبلیله به مقدار کم در این خورش استفاده شود زیرا شنبلیله به مقدار زیاد می تواند باعث تاثیر منفی روی طعم و عطر خورش شود.\n" +
            "\n" + "خرد کردن سبز قورمه سبزی\n" + "سبزی قورمه سبزی بر خلاف سبزی دیگر غذاها مثل آش و کوکو باید به طور کامل به صورت ریز خرد شود. دلیل این امر این است که اگر سبزی قورمه سبزی به صورت درشت خرد شود، خورش جا نمی افتد.\n" +
                    "\n" +
                    "در صورتی که می خواهید خورش قورمه سبزی به خوبی روغن بیندازد، حتما باید آنرا به صورت کاملا ریز خرد کنید. اگر از چاقو برای خرد کردن سبزی استفاده می کنید، حتما از یک چاقوی تیز استفاده کنید تا سبز له نشود.\n" +
            "\n" + "نشانه قورمه سبزی جا افتاده چیست؟\n" + "اصلی ترین نشانه یک قورمه سبزی جا افتاده و مجلسی این است که آب و دان قورمه سبزی از هم جدا نباشد. ( یعنی زمانی که قورمه سبزی را در خورش خوری می کشید سبزی ، لوبیا و گوشت قورمه سبزی از آب آن جدا نباشد )\n" +
                    "\n" +
                    "نکته دیگر اینکه وقتی خورش را روی برنج می ریزید نباید آب قورمه سبزی کف بشقاب جمع شود. برای اینکه با این مشکل مواجه نشوید حتما در پایان پخت اجازه دهید آب اضافی قورمه سبزی تبخیر شود و شروع به روغن انداختن بکند سپس آنرا از روی حرارت بردارید و بکشید.\n" +
            "\n" + "خورشت قورمه سبزی جنوبی\n" + "اگر می خواهید قورمه سبزی شما مثل جنوبی ها سیاه و تند و تیز شود باید از سبزی خورشتی که کمی متفاوت تر از سبزی خورشتی معمولی است استفاده کنید. جنوبی ها از سیر سبز و شوید هم در سبزی خورشتی خود استفاده می کنند.\n" +
                    "\n" +
                    "نکته دیگر اینکه باید سبزی را بیشتر از حد معمول سرخ کنید تا کاملا سیاه شود و در آخر هم به یاد داشته باشید که باید از فلفل سیاه و فلفل قرمز فراوان برای تند شدن خورش استفاده کنید چون خورش قورمه سبزی جنوبی به صورت تند سرو می شود.\n" +
            "\n" + "آموزش های بیشتر!\n" + "پس از تجربه طرز تهیه خورش قورمه سبزی، پیشنهاد می\u200Cکنیم دستورهای دیگر غذاهای سنتی ایرانی را نیز امتحان کنید. «خورش قیمه»، با طعمی متمایز از لیمو عمانی و لپه، «خورش فسنجان» با مزه\u200Cی شگفت\u200Cانگیز گردو و رب انار، و همچنین «خورش کرفس» که با عطر کرفس و گوشت، شما را به سفری دلنشین در دنیای غنی آشپزی ایرانی دعوت می\u200Cکنند.\n"
        ),
        Food(
            name = "خورشت قیمه",
            foodCategoryId = 1,
            imageUrl = "https://chishi.ir/wp-content/uploads/2019/10/gheyme.jpg",
            recipe = "خورش قیمه یکی از انواع غذاهای سنتی و بسیار پر طرفدار ایرانی است که دستورها و مواد متنوعی تهیه می شود. این خورش خوشمزه علاوه بر اینکه در مهمانی ها و مجالس مورد استفاده قرار می گیرد به عنوان یک غذای مناسبتی برای ایام مذهبی و مناسبت های خاص نیز شناخته می شود که به صورت نذری میان مردم پخش می شود. خورش قیمه به صورت سنتی با گوشت قرمز تهیه می شود، اما کسانی که منع مصرف گوشت قرمز دارند می توانند این خورش خوشمزه را با گوشت های سفید مثل گوشت مرغ یا اصلا کاملا بدون گوشت درست کنند و از میل کردن آن در کنار خانواده لذت ببرند، برای مشاهده آموزش آشپزی سنتی و مرحله به مرحله طرز تهیه خورش قیمه در ادامه با کوک بوک همراه باشید.\n" +
            "\n" + "مرحله اول\n" + "برای تهیه خورش قیمه مجلسی به روش سنتی ابتدا چند ساعت قبل از اینکه آشپزی را شروع کنید بهتر است لپه را به مدت چند ساعت در یک کاسه حاوی آب بخیسانید تا علاوه بر اینکه نفخ آن برطرف شود ، با سرعت بیشتری نیز بپزد.\n" +
            "\n" + "مرحله دوم\n" +" توصیه ما این است که هر زمانی قصد دارید قیمه درست کنید از شب قبل لپه را بخیسانید. در صورت امکان چند بار آب داخل کاسه را تعویض کنید تا به طور کامل نفخ لپه ها گرفته شود. در این مرحله ۲ تا از پیازها را به صورت نگینی ریز خرد کنید.\n" +
            "\n" + "مرحله سوم\n" + "سپس به همراه مقداری روغن مایع در قابلمه ای که برای پخت خورش در نظر گرفته اید تفت دهید تا شفاف و نرم شوند. در ادامه کمی زردچوبه به پیازها اضافه کنید و تفت دادن را تا زمانی که زردچوبه به طور کامل به خورد پیاز برود ادامه دهید.\n" +
            "\n" + "مرحله چهارم\n" + "در این مرحله گوشت گوسفندی یا گوساله را بشویید و به اندازه قورمه ای ( مانند خورش قورمه سبزی ) خرد کنید. نکته مهم در مورد خرد کردن گوشت خورشتی این است که حتما گوشت را به اندازه متوسط خرد کنید.\n" +
            "\n" + "مرحله پنجم\n" + "زیرا اگر گوشت خورشتی خیلی ریز باشد روی ظاهر خورش تاثیر منفی می گذارد و اگر خیلی بزرگ باشد علاوه بر تاثیر منفی که بر روی ظاهر خورش می گذارد باعث می شود که گوشت خورشتی دیرتر بپزد.\n" +
            "\n" + "مرحله ششم\n" + "اگر از گوشت گوسفندی استفاده می کنید قطعات را کمی بزرگتر در نظر بگیرید زیرا گوشت گوسفندی پس از پخت کمی جمع می شود. گوشت خورشتی را پس از خرد کردن به قابلمه حاوی پیاز اضافه کنید.\n" +
            "\n" + "مرحله هفتم\n" + "سپس کمی تفت دهید تا گوشت تغییر رنگ بدهد و کمی سرخ شود. در این مرحله چند دقیقه گوشت را تفت دهید تا کمی سرخ شود. سرخ شدن گوشت در این مرحله باعث می شود در پایان پخت خورش خوشمزه تری داشته باشید.\n" +
            "\n" + "مرحله هشتم\n" + "البته باید توجه داشته باشید که گوشت را بیش از حد تفت ندهید زیرا باعث می شود گوشت سفت و دیرپز شود و در پایان پخت درون دهان به راحتی آب نشود. پس از اینکه گوشت کمی سرخ شد رب گوجه فرنگی را به خورش اضافه کنید.\n" +
            "\n" + "مرحله نهم\n" + "رب گوجه فرنگی را خوب تفت دهید تا به طور کامل سرخ شود و رنگش کمی تیره شود. این کار علاوه بر اینکه طعم خورش را خوشمزه تر می کند باعث می شود در پایان کار خورش خوش رنگ تری نیز داشته باشید.\n" +
            "\n" + "مرحله دهم\n" + "البته باعث مراقب باشید که رب گوجه فرنگی را نسوزانید زیرا باعث بد طعم شدن خورش می شود. پس از اینکه رب گوجه فرنگی را خوب تفت دادید، لپه را پس از آبکشی اضافه کرده و چند دقیقه تفت دهید تا خامی آن گرفته شود.\n" +
            "\n" + "مرحله یازدهم\n" + "حالا ۴ لیوان آب به قابلمه اضافه کنید و حرارت زیر قابلمه را زیاد کنید تا آب سریعتر به جوش بیاید. پس از اینکه آب داخل قابلمه جوش آمد حرارت را ملایم کنید تا گوشت و لپه به آرامی حدود یک و نیم تا دو ساعت بپزد." +
            "\n" + "مرحله دوازدهم\n" + "در این مرحله لیمو عمانی ها را از وسط نصف کنید سپس تخمه های داخل لیمو عمانی را خارج کنید. مهم ترین دلیل تلخی خورش تخمه های لیمو عمانی هستند. پس از اینکه گوشت و لپه به طور کامل پختند لیمو ها را به خورش اضافه کنید." +
            "\n" + "مرحله سیزدهم\n" + "پس از اضافه کردن لیمو عمانی، زعفران دم کرده را به همراه مقداری نمک و فلفل سیاه به خورش اضافه کنید. اگر بخواهید خورش شما طعم خورش های نذری را به خود بگیرد باید ۱ قاشق چای\u200Cخوری دارچین به خورش خود اضافه کنید." +
            "\n" + "مرحله چهاردهم\n" + "دارچین را اگر از ابتدای پخت خورش اضافه کنید باعث می شود رنگ خورش تیره تر شود. بهتر است یا دارچین را در مراحل پایانی پخت خورش اضافه کنید یا از چوب دارچین استفاده کنید (چوب دارچین را می توانید اوایل پخت خورش اضافه کنید)." +
            "\n" + "مرحله پانزدهم\n" + "پس از اضافه کردن چاشنی ها و طعم دهنده ها حرارت زیر خورش را کم کنید تا خورش با حرارت بسیار ملایم جا بیفتد. در این مرحله سیب زمینی ها را پوست بگیرید و به صورت خلالی نازک و یکدست خرد کنید." +
            "\n" + "مرحله شانزدهم\n" + "سیب زمینی های خرد شده را چند بار با آب سرد بشویید و با دست زیر و رو کنید تا نشاسته های اضافی روی سیب زمینی ها به طور کامل از بین برود. می توانیم سیب زمینی ها را به مدت ۱۵ دقیقه درون آب سرد قرار دهیم." +
            "\n" + "مرحله هفدهم\n" + "نشاسته روی سیب زمینی علاوه بر اینکه روی طعم سیب زمینی تاثیر منفی می گذارد باعث می شود که سیب زمینی در زمان سرخ کردن به هم بچسبند. پس از آبکشی سیب زمینی ها با آب سرد انها را با یک دستمال تمیز خشک شوند." +
            "\n" + "مرحله هجدهم\n" + "سپس در روغن سرخ کنید و کنار بگذارید. برای بهتر شدن طعم سیب زمینی ها می توانید در زمان سرخ کردن کمی زردچوبه به سیب زمینی ها اضافه کنید. در پایان پس از اینکه خورش به غلظت مورد نظر شما رسید آنرا از روی حرارت بردارید، سپس در ظرف خورش خوری بکشید." +
            "\n" + "مرحله نوزدهم\n" + "خورش قیمه باید کمی آب داشته باشد پس باید حد وسط را نگه دارید، نه اجازه دهید خورش خیلی سفت شود، نه اینکه خیلی آبکی. پس از کشیدن خورش آنرا با سیب زمینی سرخ شده تزیین کرده و به همراه برنج سرو کنید."
        ),
        Food(
            name = "ته چین مرغ",
            foodCategoryId = 1,
            imageUrl = "https://chishi.ir/wp-content/uploads/2021/07/tahchin-morgh.webp",
            recipe = "ته چین مرغ یکی از انواع غذاهای محبوب ایرانی است که به عنوان یک غذای مجلسی برای مجالس مهم نیز شناخته می شود، برای مشاهده آموزش آشپزی کامل و مرحله به مرحله طرز تهیه ته چین مرغ خوشمزه و مخصوص در ادامه با کوک بوک همراه باشید. برای تهیه ته\n\u200Cچین مرغ، ابتدا مرغ را با پیاز و ادویه\u200Cها آب\u200Cپز کرده و سپس ریش\u200Cریش می\u200Cکنیم. مرغ ریش\u200Cریش شده را با کمی روغن و ادویه تفت می\u200Cدهیم. زرشک\u200Cها را جداگانه با کره تفت داده و کنار می\u200Cگذاریم. برنج را خیس کرده، پخته و آبکشی می\u200Cکنیم. برنج آبکش شده را با زرده\u200Cهای تخم\u200Cمرغ و ماست مخلوط می\u200Cکنیم. در قابلمه، ابتدا نیمی از برنج را می\u200Cریزیم، مرغ و زرشک را اضافه کرده و با بقیه برنج می\u200Cپوشانیم. برنج را فشرده و کره را روی آن قرار می\u200Cدهیم، سپس ته\u200Cچین را دم می\u200Cکنیم." +
            "\n" + "مرحله 1: آماده\u200Cسازی مرغ\n" + "برای تهیه ته چین مرغ مجلسی ابتدا گوشت مرغ را به همراه دو لیوان آب، مقداری زردچوبه، دارچین و یک عدد پیاز داخل یک قابلمه مناسب می ریزیم، سپس قابلمه را روی حرارت متوسطقرار می دهیم تا کوشت مرغ آبپز شود.\n" +
            "\n" + "مرحله 2: طعم دار کردن مرغ\n" + "برای اینکه طعم مرغ بهتر شود، بهتر است اجازه دهیم تمام آب موجود در قابلمه کشیده شود، این کار باعث می شود طعم تمام ادویه ها جذب گوشت مرغ شود. پس از اینکه مرغ را از روی حرارت برداشتیم و کمی سرد شد آنرا به صورت ریش ریش خرد می کنیم.\n" +
            "\n" + "مرحله 3: تفت دادن مرغ با ادویه\u200Cجات\n" + "پس از اینکه مرغ را ریش ریش کردیم آنرا به همراه کمی روغن مایع داخل یک تابه می ریزیم و کمی تفت می دهیم، سپس مقداری زردچوبه، دارچین و فلفل سیاه به مرغ اضافه می کنیم و تفت دادن را ادامه می دهیم تا مرغ با  ادویه ها یکدست شود، سپس مرغ را کنار می گذاریم.\n" +
            "\n" + "مرحله 4: آماده\u200Cسازی و تفت دادن زرشک\n" + "در این مرحله زرشک ها را که از ۲۰ دقیقه قبل خیسانده ایم، آبکشی می کنیم، سپس به همراه پودر قند و مقداری کره یا روغن مایع در یک تابه مناسب تفت می دهیم تا رنگ زرشک های درخشان شودف سپس زرشک را کنار می گذاریم.\n" +
            "\n" + "مرحله 5: خیساندن برنج\n" + "حالا برنج را نسبت به نوع آن بین ۳۰ دقیقه تا ۳ ساعت به همراه ۱ قاشق چایخوری نمک و آب ولرم می خیسانیم. در ادامه یک قابلمه مناسب روی حرارت قرار می دهیم و انرا تا نیمه آب پر می کنیم و اجازه می دهیم آب به جوش بیاید.\n" +
            "\n" + "مرحله 6: جوشاندن برنج\n" + "پس از اینکه آب جوش آمد، ۱ قاشق چایخوری نمک و ۱ قاشق غذاخوری روغن مایع به قابلمه اضافه می کنیم. در ادامه برنج خیسانده شده را به آب جوش اضافه می کنیم و اجزاه می دهیم به مدت ۷ تا ۱۰ دقیقه پخت اولیه برنج انجام شود.\n" +
            "\n" + "مرحله 7: آبکشی برنج و آماده\u200Cسازی زرده تخم\u200Cمرغ\n" + "زمانی که دانه های برنج کاملا نرم شدند ولی مغزشان سفت بود و زیر دندان گیر داشت باید برنج را آبکشی کنیم. پس از اینکه برنج را آبکش کردیم انرا کنار می گذاریم. در ادامه زرده های تخم مرغ را داخل یک کاسه بزرگ می ریزیم.\n" +
            "\n" + "مرحله 8: مخلوط کردن زرده تخم\u200Cمرغ با ماست و گلاب\n" + "در این مرحله زرده های تخم مرغ را مخلوط می کنیم تا از حالت لختگی خارج شوند، سپس ماست چکیده را به همراه گلاب و زعفران دم کرده به کاسه اضافه می کنیم و به خوبی ترکیب می کنیم تا مواد کاملا مخلوط و یکدست شوند.\n" +
            "\n" + "مرحله 9: اضافه کردن برنج به مخلوط تخم\u200Cمرغ و ماست\n" + "در این مرحله برنج آبکش شده را به کاسه حاوی مخلوط تخم مرغ و ماست اضافه می کنیم و به آرامی مخلوط می کنیم تا با هم یکدست شوند. در ادامه قابلمه ای که برای پخت ته چین در نظر گرفته ایم را با کمی روغن چرب می کنیم.\n" +
            "\n" + "مرحله 10: تهیه لایه\u200Cهای ته\u200Cچین در قابلمه\n" + "در این مرحله نصف مخلوط رنج را کف قابلمه می ریزیم و با پست قاشق به خوبی فشرده می کنیم، سپس مرغ تفت داده شده را به همراه زرشک روی برنج می ریزیم. در ادامه باقیماند مخلوط برنج را به قابلمه اضافه می کنیم.\n" +
            "\n" + "مرحله 11: فشردن برنج و اضافه کردن کره\n" + "حالا مجددا برنج را با پشت قاشق فشرده می کنیم تا ته چین پس از پخت از هم با نشود. در ادامه کره را به تکه های کوچک تقسیم می کنیم و به صورت پخش روی برنج قرار می دهیم. حالا قابلمه را روی حرارت بسیار ملایم قرار می دهیم.\n" +
            "\n" + "مرحله 12: دم کردن ته\u200Cچین و تزیین نهایی\n" + "برای دم کشیدن ته چین حدود ۴۵ دقیقه تا یک ساعت زمان نیاز است. در پایان پس از اینکه پخت ته چین به پایان رسید، آنرا به آرامی روی یک ظرف مناسب بر می گردانیم، سپس با خلال پسته و زرشک تزیین می کنیم.\n"
        ),
        Food(
            name = "چلو کباب کوبیده",
            foodCategoryId = 1,
            imageUrl = "https://chishi.ir/wp-content/uploads/2020/05/kabab-koubide.jpg",
            recipe = "کباب کوبیده یکی از غذاهای بسیار معروف و سنتی ایرانی است که به عنوان یک غذای مجلسی هم شناخته می شود. تاریخچه کباب کوبیده به دوران قاجار بر می گردد و به همین دلیل این غذا یکی از غذاهای قدیمی ایرانی محسوب می شود. کباب کوبیده دارای محبوبیت بسیار زیادی در میان ایرانیان است و به همین دلیل در خیلی از مجالس شادی و عزا از آن برای پذیرایی استفاده می شود. به دلیل همین محبوبیت کباب کوبیده با دستورهای متنوعی مانند کباب کوبیده تابه ای، کباب کوبیده با گوشت مرغ، کباب کوبیده با سویا و .. تهیه می شود که می تواند تمام سلایق و ذائقه ها را در بر گیرد، برای مشاهده آموزش کامل و مرحله به مرحله طرز تهیه کباب کوبیده در ادامه با کوک بوک همراه باشید.\n" +
            "\n" + "مرحله اول\n" + "برای تهیه کباب کوبیده رستورانی ابتدا ۴۰۰ گرم گوشت راسته گوسفندی را به همراه ۴۰۰ گرم گوشت قلوه گاه گوساله و دنبه گوسفندی داخل چرخ گوشت می ریزیم و دو مرتبه چرخ می کنیم تا کاملا با هم ترکیب شده و یکدست شوند.\n" +
            "\n" + "مرحله دوم\n" + "در این مرحله گوشت چرخ کرده را داخل یک کاسه مناسب و جادار قرار می دهیم. در ادامه در ظرفی جداگانه پیازها را با رنده متوسط رنده می کنیم و با فشار دست آب اضافی شان را به طور کامل می گیریم، سپس آب پیاز را داخل یک کاسه کوچک می ریزیم و کنار می گذاریم.\n" +
            "\n" + "مرحله سوم\n" + "در این مرحله پیاز آب گرفته را به مدت ۱۵ دقیقه درون یخچال قرار می دهیم تا به اصلاح چلوکبابی ها شیرین شود، سپس به گوشت چرخ کرده اضافه می کنیم. در ادامه بکینگ پودر را به همراه مقداری نمک، فلفل سیاه و ۲ قاشق غذاخوری زعفران دم کرده به گوشت اضافه می کنیم.\n" +
            "\n" + "مرحله چهارم\n" + "در این مرحله مواد کباب را باید به خوبی ورز دهیم تا گوشت منسجم شود به طور که حالت چسبناکی پیدا کند که وقتی مایه کباب را از داخل کاسه بلند می کنید تکه تکه نشود و همه گوشت به صورت یکدست بلند شود.\n" +
            "\n" + "مرحله پنجم\n" + "ورز دادن را ادامه می دهیم تا مایه کباب یکدست و کاملا منسجم شود، سپس یک سلفون روی کاسه می کشیم و به مدت ۲ ساعت به مایه کباب در یخچال استراحت می دهیم. پس از گذشت ۲ ساعت کاسه را از یخچال خارج می کنیم.\n" +
            "\n" + "مرحله ششم\n" + "برای سیخ کردن کباب ها ابتدا سیخ های پهن مخصوص کباب کوبیده را با آب پیاز خیس می کنیم سپس به اندازه یک پرتقال کوچک از گوشت بر می داریم و سیخ را بین گوشت قرار می دهیم و آنرا روی سیخ پهن می کنیم.\n" +
            "\n" + "مرحله هفتم\n" + "پس از سیخ کردن کباب با انگشت روی گوشت نقش می اندازیم، این کار علاوه بر اینکه باعث می شود کباب مغز پخت شود، به زیبایی ظاهری کباب نیز کمک می کند. اگر کار سیخ کردن کباب برایتان مشکل است می توانید از کباب زن دستی هم استفاده کنید.\n" +
            "\n" + "مرحله هشتم\n" + "در این مرحله منقل ذغال را با ذغالی یکدست و کاملا روشن آماده می کنیم، سپس سیخ ها را به آرامی روی منقل می چینیم. پس از آنکه کباب ها خودشان را گرفتند، آنها را به صورت متداوم می چرخانیم تا به صورت یکنواخت بپزند.\n" +
            "\n" + "مرحله نهم\n" + "پس از اینکه پختن کباب ها به پایان رسید، کره را روی بخار آب ذوب می کنیم و به همراه زعفران با یک برس تمیز روی کباب ها می مالیم. این کار علاوه بر اینکه کباب ها را زیباتر می کند، بعث خوشمزه تر شدن کباب کوبیده می شود.\n"
        ),
        Food(
            name = "زرشک پلو با مرغ",
            foodCategoryId = 1,
            imageUrl = "https://chishi.ir/wp-content/uploads/2019/11/zereshk-polo-ba-morgh.jpg",
            recipe = ""
        ),
        Food(
            name = "سبزی پلو با ماهی",
            foodCategoryId = 1,
            imageUrl = "https://chishi.ir/wp-content/uploads/2020/08/sabzi-polo-mahi.jpg",
            recipe = ""
        ),
        Food(
            name = "قلیه ماهی",
            foodCategoryId = 1,
            imageUrl = "https://chishi.ir/wp-content/uploads/2020/01/ghaliye-mahi.jpg",
            recipe = ""
        ),
        Food(
            name = "میگو پلو",
            foodCategoryId = 1,
            imageUrl = "https://chishi.ir/wp-content/uploads/2020/06/meygoo-polo.jpg",
            recipe = ""
        ),
        Food(
            name = "فلافل",
            foodCategoryId = 1,
            imageUrl = "https://chishi.ir/wp-content/uploads/2019/10/falafel.jpg",
            recipe = ""
        ),
        Food(
            name = "باقالی پلو با گردن",
            foodCategoryId = 1,
            imageUrl = "https://chishi.ir/wp-content/uploads/2020/07/baghali-polo-gardan.jpg",
            recipe = ""
        ),

//------    farangiFoods

        Food(
            name = "بیف استروگانف",
            foodCategoryId = 2,
            imageUrl = "https://chishi.ir/wp-content/uploads/2020/01/bif-esteraganof.jpg",
            recipe = "بیف استروگانف یکی از انواع غذاهای بسیار معروف و خوشمزه کشور روسیه است که در سراسر جهان به عنوان یک غذای بین المللی شناخته می شود. این غذای خوشمزه را با مرغ هم درست می کنند که با نام چیکن استروگانف شناخته می شود. برای مشاهده آموزش کامل و مرحله به مرحله طرز تهیه بیف استروگانوف در ادامه با CookBook همراه باشید.\n" +
            "\n" + "مرحله اول\n" + "ابتدا پیاز را به صورت نگینی یا خلالی خرد می کنیم سپس به همراه مقداری روغن مایع داخلی یک تابه مناسب تفت می دهیم تا پیاز نرم و سبک شود ، در ادامه مقداری زردچوبه اضافه کرده و تفت دادن را ادامه می دهیم تا پیاز و زردچوبه یکدست شوند.\n" +
            "\n" + "مرحله دوم\n" + "در مرحله بعدی گوشت گوساله را پس از شستشو به شکل نوارهای نازک و بلند برش می دهیم سپس به تابه اضافه کرده و خوب تفت می دهیم تا رنگ گوشت تغییر کند و کمی سرخ شود سپس ۲ لیوان آب جوش به تابه اضافه می کنیم.\n" +
            "\n" + "طرز تهیه بیف استروگانوف\n" + "حرارت را کم می کنیم و درب تابه را می گذاریم تا گوشت با حرارت ملایم بپزد و آب موجود در تابه تبخیر شود. در حین آماده شدن گوشت به سراغ قارچ ها می رویم. ابتدا قارچ ها را به خوبی تمیز می کنیم و می شوییم.\n" +
            "\n" + "مرحله چهارم\n" + "در ادامه قارچ ها را با یک دستمکال تمیز خشک می کنیم و به صورت ورقه ای خرد می کنیم و کنار می گذاریم. زمانی که گوشت پخت و آب درون تابه تبخیر شد قارچ ها را به تابه اضافه می کنیم و کمی تفت می دهیم تا قارچ ها آب بیندازند.\n" +
            "\n" + "مرحله پنجم\n" + "تفت دادن قارچ ها را ادامه می دهیم تا آب قارچ ها نیز تبخیر شود سپس شیر را داخل یک کاسه مناسب می ریزیم و آرد را کم کم اضافه می کنیم تا آرد گلوله نشود سپس مقداری نمک و فلفل سیاه به شیر اضافه می کنیم و خوب مخلوط می کنیم.\n" +
            "\n" + "طرز تهیه بیف استروگانوف\n" + "پس از اینکه شیر و دیگر مواد یکدست شدند آنرا به تابه حاوی گوشت اضافه می کنیم و مواد را به صورت متداوم مخلوط می کنیم تا شیر حباب بزند ، پس از اینکه شیر حباب زد تابه را از روی حرارت بر می داریم و کنار می گذاریم.\n" +
            "\n" + "مرحله هفتم\n" + "در مرحله بعدی خامه را به تابه اضافه می کنیم و با دیگر مواد به خوبی مخلوط می کنیم. بیف استروگانف اماده است فقط باید سیب زمینی ها را نیز برای تزیین این غذا اماده کنیم. سیب زمینی بی فستروگانف باید به شکل خیلی نازک برش داده شود.\n" +
            "\n" + "مرحله هشتم\n" + "برای خرد کردن یک دست سیب زمینی ها می توانید از دندانه درشت رنده استفاده کنید. در اخر یک ظرف گود حاوی روغن مخصوص سرخ کردنی روی حرارت قرار می دهیم و با حرارت بالا سیب زمینی ها را سرخ می کنیم و در کنار ظرف غذا سرو می کنیم.\n" +
            "\n" + "گوشت مخصوص بیف استراگانوف\n" + "یکی از نکات مهم در تهیه بیف استراگانوف انتخاب گوشت تازه و مناسب می باشد. بهترین نوع گوشت برای تهیه این غذا استفاده از فیله یا راسته گوساله می باشد. البته از گوشت دنده بدون استخوان هم می توانید استفاده کنید.\n"
        ),
        Food(
            name = "رست بیف",
            foodCategoryId = 2,
            imageUrl = "https://chishi.ir/wp-content/uploads/2020/07/sandevich-rost-biff.jpg",
            recipe = "ساندویچ رست بیف یکی از انواع ساندویچ های خوشمزه و پرطرفدار در سراسر جهان است که با گوشت گوساله تهیه می شود. این ساندویچ خوشمزه یکی از ساندویچ های نوستالوژیک در میان ایرانیان است که در گذشته پایه ثابت همه ساندویچ فروشی ها بود. ساندویچ رست بیف معمولا به همراه سس قارچ سرو می شود که به همین دلیل بسیار لذیذتر می شود، اما اگر نگران کالری سس قارچ هستید می توانید این ساندویچ خوشمزه و دوست داشتنی را با انواعسس های مورد سلیقه خود نوش جان فرمایید، برای مشاهده این آموزش آشپزی در ادامه با سایت آموزشی چیشی همراه باشید.\n" +
            "\n" + "مرحله اول\n" + "برای تهیه ساندویچ رست بیف خانگی ابتدا گوشت راسته گوساله را داخل یک کاسه مناسب می ریزیم، سپس روغن زیتون را به همراه رزماری ساطوری شده و مقداری نمک و فلفل سیاه به کاسه حاوی گوشت اضافه می کنیم.\n" +
            "\n" + "مرحله دوم\n" + "گوشت را چند دقیقه با مواد طعم دهنده ماساز می دهیم، سپس یک سلفون روی کاسه می کشیم و به مدت ۲ ساعت در یخچال قرار می دهیم تا گوشت طعم دار شود. پس از گذشت این زمان گوشت را از یخچال خارج می کنیم.\n" +
            "\n" + "مرحله سوم\n" + "در این مرحله گریل یا تابه گریل دار را روی حرارت قرار می دهیم و دو طرف گوشت را گریل می کنیم، سپس آنرا به صورت ریش ریش یا نازک برش می زنیم و کنار می گذاریم. اگر بخواهیم گوشت کاملا مغز پخت باشد پس از خرد کردن آنرا کمی تفت می دهیم.\n" +
            "\n" + "مرحله چهارم\n" + "در این مرحله قارچ را به صورت اسلایس شده خرد می کنیم، سپس به همراه کمی روغن در یک تابه مناسب تفت می دهیم تا کاملا سرخ شود. در ادامه آرد را به تابه اضافه می کنیم و کمی تفت می دهیم تا بوی خامی آرد گرفته شود.\n" +
            "\n" + "مرحله پنجم\n" + "در ادامه شیر را اضافه می کنیم و صبر می کنیم تا سس با حرارت ملایم غلیظ شود. پس از اینکه سس غلیظ شد، خامه را به همراه پنیر پیتزا، پنیر گودا و مقداری نمک و فلفل سیاه به سس اضافه می کنیم و اجازه می دهیم پنیرها ذوب شوند.\n" +
            "\n" + "مرحله ششم\n" + "حالا نان باگت را باز می کنیم و مقداری از سس داخل نان باگت می ریزیم، سپس مقداری از گوشت گریل شده را به همراه مقداری گوجه فرنگی، خیارشور و کاهوی خرد شده اضافه می کنیم و به همراه سس دلخواه سرو می کنیم.\n"
        ),
        Food(
            name = "پاستا آلفردو",
            foodCategoryId = 2,
            imageUrl = "https://chishi.ir/wp-content/uploads/2020/12/pasta-alferedo.jpg",
            recipe = "پاستا آلفردو یکی از انواع غذاهای خوشمزه بین المللی است که با دستورهای متنوعی در کشورهای مختلف تهیه می شود. این غذای خوشمزه اصالتی ایتالیایی دارد و به دلیل اینکه با سس آلفردو تهیه می شود با نام پاستا آلفردو شناخته می شود. سس آلفردو یکی از انواع سس های بسیار معروف و شناخته شده کشور ایتالیا است که توسط آلفردو دی للیلو در سال 1914 برای اولین بار ابداع شده است. البته در ابتدا برای تهیه این سس از تخم مرغ استفاده می شود ولی امروزه این سس به صورت پر چرب و خوشمزه تهیه می شود که در تهیه آن از خامه و شیر استفاده می شود، برای مشاهده این آموزش آشپزی در ادامه با سایت چی شی همراه باشید.\n" +
            "\n" + "مرحله اول\n" + "برای تهیه پاستا آلفردو رستورانی ابتدا  قارچ ها را با دستمال تمیز می کنیم و سریع آبکش می کنیم، سپس روی تخته آشپزخانه به صورت اسلایس شده خرد می کنیم و در بشقابی می ریزیم و کنار می گذاریم.\n" +
            "\n" + "مرحله دوم\n" + "البته می توانید پوست روی آن ها را نیز قبل از خرد کردن بگیرید که این کاملا سلیقه ای است. در ادامه سیرها را نیز پوست می گیریم و می شوییم و ریز خرد می کنیم و در گوشه ای از بشقاب محتوی قارچ ها می ریزیم و کنار می گذاریم.\n" +
            "\n" + "مرحله سوم\n" + "بعد سینه مرغ را می شوییم و روی تخته آشپزخانه قرار می دهیم و استخوان های آن را کاملا خارج می کنیم و از عرض هر طرف سینه مرغ را برش می زنیم و کمی سرکه روی هر دو طرف مرغ می ریزیم.\n" +
            "\n" + "مرحله چهارم\n" + "حالا آن را به همه نقاط سینه مرغ پخش می کنیم و کمی آویشن،فلفل سیاه و نمک روی آن می پاشیم.بهتر است برای زودتر آماده شدن پاستا از دو تابه همزمان استفاده کنیم و هر دو را روی گاز قرار دهیم.\n" +
            "\n" + "مرحله پنجم\n" + "یکی از تابه ها که گریل دارد برای سینه مرغ استفاده می شود و تابه دوم برای پختن پاستا  است.این کار باعث می شود هیچ کدام از مواد سرد نشود.قابلمه ای را تقریبا تا نیمه آبجوش می کنیم و روی حرارت زیاد قرار می دهیم.\n" +
            "\n" + "مرحله ششم\n" + "سپس پنه را داخل آن می ریزیم تا به مدت حدودا 30 دقیقه نرم شود. در ادامه داخل تابه گریل 2 الی 3 قاشق غذاخوری روغن زیتون می ریزیم و روی حرارت ملایم قرار می دهیم و سینه مرغ ها را داخل آن می چینیم تا گریل شوند.\n" +
            "\n" + "مرحله هفتم\n" + "در تابه دوم قارچ های خرد شده را می ریزیم و و 2 قاشق غذاخوری روغن زیتون به ان اضافه می کنیم و مداوم قارچ ها را تفت می دهیم تا آب آن ها تبخیر شود و بعد شیر را به آن اضافه می کنیم و اجازه می دهیم تا به جوش بیاید.\n" +
            "\n" + "مرحله هشتم\n" + "به سینه مرغ ها سر می زنیم و اگر یک طرف آنها کاملا گریل شده است آن ها را بر می گردانیم تا طرف دیگرشان نیز گریل شود. پس از اینکه شیر در حال جوشیدن بود سیرهای خرد شده را می افزاییم.\n" +
            "\n" + "مرحله نهم\n" + "سپس بلافاصله 1 قاشق غذاخوری آرد را با دو الی 3 قاشق غذاخوری شیر سرد حل می کنیم و اضافه می کنیم و مواد را مخلوط می کنیم و 2 دقیقه بعد خامه را همراه با کمی فلفل سیاه اضافه می کنیم.\n" +
            "\n" + "مرحله دهم\n" + "حدود 3 دقیقه بعد حرارت را خاموش می کنیم و در آخر کمی جعفری خرد شده به سس اضافه می کنیم و خوب با سس مخلوط می کنیم.تابه محتوی سینه های مرغ را نگاه می کنیم اگر کاملا گریل شده بودند حرارت را خاموش می کنیم.\n" +
            "\n" + "مرحله یازدهم\n" + "در این مرحله پاستاهای نرم و پخته شده را داخل آبکش می ریزیم و آب اضافه آن ها که خارج شد پاستاها را داخل تابه محتوی سس آلفردوی داغ می ریزیم و کمی هم می زنیم تا با هم یکدست شوند.\n" +
            "\n" + "مرحله دوازدهم\n" + "پس از اینکه همگی پاستاها به سس آغشته شدند و به خوبی گرم شدند، آنها را در ظرف مورد نظر مان می کشیم، سپس سینه های مرغ گریل شده را خرد می کنیم و روی پاستا می چینیم و نوش جان کنید.\n"
        ),
        Food(
            name = "ریزوتو",
            foodCategoryId = 2,
            imageUrl = "https://chishi.ir/wp-content/uploads/2021/07/rizoto-loghme.jpg",
            recipe = "ریزوتو نوعی برنج دانه تپل مخصوص نواحی شمال ایتالیاست که به صورت دمی تهیه می \u200Cشود و در کلیه فروشگاه های معتبر توزیع می \u200Cشود. همچنین به جای آن از برنج نیمه دانه نیز می توان استفاده کرد. ریزوتو، برنجی ایتالیایی است که با آب گوشت یا مرغ درست شده و به صورت قالبی خمیری در کنار بشقاب سرو می\u200C شود و تجربه ای متفاوت از طعم و بوی برنج را یادآوری می\u200C کند. برای مشاهده آموزش کامل و مرحله به مرحله طرز تهیه ریزوتو لقمه ای در ادامه با سایت آموزشی چی شی همراه باشید.\n" +
            "\n" + "مرحله اول\n" + "برای تهیه غذای ایتالیایی خوشمزه ریزوتو لقمه ای در ابتدای کار، گوجه فرنگی را با کمی آب جوش می\u200C خیسانیم تا نرم شوند. در ادامه کره و روغن زیتون را در یک تابه مناسب می \u200Cریزیم، سپس روی حرارت ملایم قرار می دهیم.\n" +
            "\n" + "مرحله دوم\n" + "پس از اینکه روغنو کره داغ شدند، پیاز را شسته و پوست می کنیم، سپس آن را رنده می \u200Cکنیم و به تابه اضافه می کنیم. در ادامه پیاز را به خوبی تفت می\u200C دهیم، سپس برنج شسته شده را اضافه می \u200Cکنیم، کمی در تابه تفت می\u200C دهیم.\n" +
            "\n" + "مرحله سوم\n" + "در این مرحله آب مرغ را به تابه اضافه می کنیم و اجازه می \u200Cدهیم تا برنج بپزد و آب درون تابه به طور کامل کشیده شود. اگر در این فاصله برنج پخته نشد، مجددا مقداری کمی آب به تابه اضافه می\u200C کنیم و صبر می کنیم تا خوب بپزد.\n" +
            "\n" + "مرحله چهارم\n" + "در این مرحله، پنیر پارمزان را اضافه می \u200Cکنیم، سپس تابه را از روی حرارت بر می\u200Cداریم و مواد را کنار می\u200C گذاریم تا خنک شوند. در این فاصله سس پستو را آماده می \u200Cکنیم. برای این کار، سیر، دانه کاج، برگ ریحان، روغن زیتون، نمک و فلفل را داخل غذاساز می\u200C ریزیم.\n" +
            "\n" + "مرحله پنجم\n" + "حالا ادویه ها را کاملا با هم مخلوط می\u200C کنیم. سس را به ترکیب فوق اضافه کرده و به خوبی مخلوط می \u200Cکنیم. در ادامه کف دست را با مقداری روغن مایع چرب می\u200C کنیم و مقداری از مایع بر می\u200C داریم و در کف دست پهن می \u200Cکنیم.\n" +
            "\n" + "مرحله ششم\n" + "سپس سطح آن را پنیر موزارلا و گوجه فرنگی می \u200Cگذاریم و خمیر روی ریزوتو را از دو طرف بر می \u200Cگردانیم و گرد می\u200C کنیم. گلوله ها را در پودر سوخاری می غلتانیم و در روغن زیاد سرخ می \u200Cکنیم. این غذا، همراه با سالاد با پایه کاهو سرو می \u200Cشود.\n"
        ),
        Food(
            name = "پاستا آلفردو",
            foodCategoryId = 2,
            imageUrl = "https://chishi.ir/wp-content/uploads/2023/01/pasta-pesto.jpg",
            recipe = "" +
            "\n" + "مرحله اول\n" + "برای تهیه پاستا پستو خوشمزه در صورت تمایل می توانید سس پستو را از یک روز قبل آماده کنید تا به خوبی جا بیفتد. البته رنگ سبز آن ممکن است پس از یک روز کمی تیره می شود، ولی طعم پاستا خوشمزه تر می شود.\n" +
            "\n" + "مرحله دوم\n" + "برای جلوگیری از تیره شدن سس پستو در این فاصله ابتدا ریحان ها را شسته و به مدت ۳۰ ثانیه درون کاسه حاوی آب\u200C جوش گذاشته، سپس بلافاصله درون کاسه حاوی آب یخ می ریزیم و پس از ۱ دقیقه درون غذاساز می ریزیم.\n" +
            "\n" + "مرحله سوم\n" + "حالا سیر را به همراه آب لیمو، گردو، روغن زیتون و پنیر پارمزان به غذاساز اضافه کرده و به خوبی میکس می کنیم تا پوره شوند. در نهایت سس را به مدت ۱ روز درون یخچال گذاشته تا مزه ها با هم ترکیب شده و پس از آن پاستا را درست می کنیم.\n" +
            "\n" + "مرحله چهارم\n" + "پس از استراحت کردن سس، یک قابلمه مناسب را تا نیمه پر از آب می کنیم\u200C، سپس روی حرارت زیاد قرار داده و اجازه می دهیم آب به نقطه جوش برسد. در ادامه پاستا را به قابلمه حاوی آب جوش اضافه می کنیم.\n" +
            "\n" + "مرحله پنجم\n" + "حالا به قابلمه مقداری نمک و روغن مایع می افزاییم، سپس اجازه می دهیم پاستا پنه به مدت ۱۰ دقیقه درون آب جوش بماند تا کاملا پخته و نرم شود. پس از اتمام پخت پاستا، قابلمه را از روی حرارت بر می داریم.\n" +
            "\n" + "مرحله ششم\n" + "در ادامه پاستا را درون آبکش ریخته و کنار می گذاریم تا آب اضافی اش خارج شود. حالا یک تابه مناسب روی حرارت گذاشته و سس را به آن اضافه می کنیم، سپس چند قاشق از آب پاستای درون قابلمه به تابه اضافه کرده و مخلوط می کنیم.\n" +
            "\n" + "مرحله هفتم\n" + "حالا سس پستو را به مدت ۲ دقیقه تفت می دهیم تا عطر سس آزاد شود، سپس پاستا آبکشی شده را به تابه اضافه کرده و به خوبی مخلوط می کنیم تا سس به خورد پاستا برود. در ادامه به دلخواه مقداری پنیر پارمزان به تابه می افزاییم.\n" +
            "\n" + "مرحله هشتم\n" + "حالا پاستا را مخلوط کرده و درب آنرا می بندیم تا پنیر آب شده و مزه ها با هم ترکیب شوند. پس از گذشت چند دقیقه درب تابه را باز کرده و پس از مخلوط کردن پاستا، تابه را از روی حرارت کنار گذاشته و پاستا را درون ظرف سرومان می ریزیم.\n" +
            "\n" + "مرحله نهم\n" + "در ادامه این غذای خوشمزه و گیاهی را به دلخواه با برگ ریحان و اسلایس های لیمو ترش تازه تزیین می کنیم. در نهایت بنا به ذائقه هر فرد مقداری پنیر پارمزان به صورت پخش روی آن می ریزیم و سرو می کنیم. نوش جان.\n"
        ),

        //EasternFoods

        Food(
            name = "سوشی ژاپنی",
            foodCategoryId = 3,
            imageUrl = "https://chishi.ir/wp-content/uploads/2022/08/soshi.jpg",
            recipe = "سوشی یکی از انواع غذاهای خوشمزه و پرطرفدار کره ای است که با رسپی و مواد متنوعی درست می شود، برای مشاهده آموزش کامل و مرحله به مرحله طرز تهیه سوشی در ادامه با CookBook همراه باشید.\n" +
            "\n" + "مرحله اول\n" + "برای تهیه سوشی خوشمزه در ابتدای کار زردک را می شوییم و پوست آنرا جدا کرده، سپس درون یک قابلمه حاوی آب می گذاریم. حالا قابلمه را روی حرارت گذاشته و اجازه می دهیم زردک کاملا پخته شود.\n" +
            "\n" + "مرحله دوم\n" + "حالا هویج را شسته و پس از جدا کردن پوست آن به صورت خلالی خرد می کنیم. در ادامه یک تابه مناسب روی حرارت ملایم گذاشته و مقداری روغن مایع به آن می افزاییم، سپس هویج را به تابه اضافه کرده و تفت می دهیم.\n" +
            "\n" + "مرحله سوم\n" + "زمانی که هویج کاملا سرخ شد، آنرا از تابه خارج کرده و روی دستمال روغن گیری قرار می دهیم. در ادامه برنج را به همراه یک و نیم لیوان آب درون یک قابلمه مناسب ریخته و قابلمه را روی حرارت متوسط می گذاریم.\n" +
            "\n" + "مرحله چهارم\n" + "حالا اجازه می دهیم برنج روی حرارت بماند تا آب درون قابلمه کاملا کشیده شده و برنج شفته شود. زمانی که برنج شفته شد، آنرا درون یک کاسه مناسب می ریزیم، سپس شکر را به همراه سرکه سیب و مقداری نمک به آن می افزاییم.\n" +
            "\n" + "مرحله پنجم\n" + "حالا برنج را به خوبی مخلوط کرده تا دانه های برنج طعم دار شوند. زمانی که زردک کاملا پخت، آنرا به همراه خیار به صورت خلالی نازک خرد کرده، سپس برگ کیم را روی سطح کار پهن می کنیم و برنج را روی برگ می ریزیم.\n" +
            "\n" + "مرحله ششم\n" + "در ادامه برنج را به صورت یکنواخت پهن کرده، سپس کنجد سیاه را به صورت پخش روی برنج می پاشیم. حالا اسفناج را شسته و یک تابه مناسب روی حرارت قرار می دهیم و اسفناج ها را بدون روغن درون تابه می ریزیم.\n" +
            "\n" + "مرحله هفتم\n" + "حالا اسفناج را تفت می دهیم تا تغییر رنگ داده و آب اضافی اش کشیده شود. در ادامه اسفناج را در ابتدای برنج ریخته و به ترتیب خیار، هویج و زردک را روی اسفناج می ریزیم، سپس سوشی را به آرامی رول می کنیم.\n" +
            "\n" + "مرحله هشتم\n" + "در این مرحله سوشی را با یک چاقو تیر برش زده و پس از هر برش چاقو را با دستمال تمیز می کنیم. در نهایت برش های سوشی را درون ظرف مورد نظرمان قرار می دهیم و به همراه سس سویا سرو می کنیم. نوش جان.\n"
        ),
        Food(
            name = "خوراک گوشت چینی",
            foodCategoryId = 3,
            imageUrl = "https://chishi.ir/wp-content/uploads/2024/04/Khorak-Gosht-Chini.webp",
            recipe = "خوراک گوشت چینی، غذایی خوش طعم و پرطرفدار است که دارای طعمی بی\u200Cنظیر و کاملاً منحصربه\u200Cفرد است. این غذا، که از ترکیب گوشت با سبزیجات تازه و چاشنی\u200Cهای مختلف به درست می شود، نه تنها یک وعده غذایی لذیذ است بلکه یک انتخاب عالی برای آن دسته از افرادی است که به دنبال تجربه\u200Cای جدید در آشپزی هستند.\n" +
                    "برای تهیه خوراک گوشت چینی به روش خانگی، ابتدا گوشت استیک را به صورت خلالی باریک برش دهید و آن را به همراه پیاز، پودر سیر، و زنجفیل در روغن زیتون برای ۱۰ دقیقه تفت دهید. سپس سس سویا و کلم بروکلی خرد شده را اضافه کرده و برای ۵ دقیقه دیگر تفت دهید. در نهایت، با حرارت پایین اجازه دهید تا خوراک کاملاً پخته شود و مواد به خوبی با هم ترکیب گردند. هنگام سرو، غذا را با پیازچه خرد شده تزیین کنید و به همراه برنج نوش جان فرمایید.\n" +
            "\n" + "مرحله 1: آماده\u200Cسازی گوشت\n" + "برای تهیه خوراک گوشت چینین خوشمزه ابتدا گوشت استیک را به صورت خلالی باریک و یکدست برش دهید. برش\u200Cهای گوشت باید به اندازه\u200Cای نازک باشند تا در حین پخت به خوبی و سریع مزه\u200Cدار و نرم شوند.\n" +
            "\n" + "مرحله 2: تفت دادن اولیه گوشت\n" + "در این مرحله گوشت خلال شده را به همراه مقداری روغن زیتون در  یک تابه مناسب بریزید و روی حرارت قرار دهید، سپس پودر سیر و زنجفیل را اضافه کنید و برای ۱۰ دقیقه تفت دهید تا گوشت کمی سرخ شود.\n" +
            "\n" + "مرحله 3: اضافه کردن سس و سبزیجات\n" + "پس از اینکه گوشت به خوبی با ادویه\u200Cجات تفت داده شد، سس سویا و کلم بروکلی خرد شده را به مخلوط اضافه کنید. توصیه سایت چی شی این است که بروکلی\u200Cها نباید خیلی ریز خرد شوند تا بافت خود را در هنگام تفت دادن حفظ کنند.\n" +
            "\n" + "مرحله 4: تفت دادن سبزیجات\n" + "در این مرحله پس از اضافه کردن کلم بروکلی و سس سویا، مواد را برای ۵ دقیقه دیگر تفت دهید. این مرحله به بروکلی فرصت می\u200Cدهد تا کمی نرم شود اما هنوز ترد و سبز باقی بماند.\n" +
            "\n" + "مرحله 5: پختن با حرارت پایین\n" + "حالا زمان آن است که حرارت را کم کنید و به مخلوط اجازه دهید تا به آرامی پخته شود و مزه\u200Cها به خوبی به هم ترکیب شوند. این مرحله کمک می\u200Cکند تا خوراک عطر و طعم دلچسبی پیدا کند.\n" +
            "\n" + "مرحله 6: آماده\u200Cسازی برای سرو\n" + "پس از اینکه خوراک به خوبی پخته و مزه\u200Cها با هم ترکیب شدند، آن را از روی حرارت بردارید و آماده سرو کنید. این خوراک با برنج سفید یا برنج بخارپز چینی بسیار خوشمزه خواهد بود که سلیقه ای می باشد.\n" +
            "\n" + "مرحله 7: تزیین و سرو\n" + "هنگام سرو، خوراک گوشت چینی را با پیازچه خرد شده تزیین کنید تا علاوه بر زیبایی، عطر و طعم تازه\u200Cای به غذا اضافه شود. حالا می\u200Cتوانید به همراه عزیزانتان از این غذای لذیذ نوش جان کنید.\n"
        ),
        Food(
            name = "کیمچی کره ای",
            foodCategoryId = 3,
            imageUrl = "https://chishi.ir/wp-content/uploads/2022/08/kimchi-torob-sefid.jpg",
            recipe = "کیمچی ترب سفید یکی از انواع غذاهای خوشمزه و پرطرفدار کشور کره جنوبی است که با رسپی های مختلفی درست می شود، برای مشاهده آموزش کامل و مرحله به مرحله طرز تهیه کیمچی ترب سفید در ادامه با CookBook همراه باشید.\n" +
            "\n" + "مرحله اول\n" + "برای تهیه کیمچی ترب سفید خوشمزه در ابتدای کار پوست ترب سفید را جدا کرده و به صورت نگینی متوسط خرد می کنیم، سپس درون یک ظرف مناسب می ریزیم. در ادامه نمک و شکر را به صورت پخش روی ترب می ریزیم.\n" +
            "\n" + "مرحله دوم\n" + "حالا ترب را به خوبی ماساژ می دهیم و اجازه می دهیم ترب به مدت ۳۰ دقیقه در دمای محیط استراحت کند تا مزه دار شود، سپس آب بیندازد. پس از گذشت این زمان نصف مقدار آب ترب را جدا می کنیم و کنار می گذاریم.\n" +
            "\n" + "مرحله سوم\n" + "در ادامه زنجبیل تازه را به همراه سیر به صورت ریز رنده کرده و به کاسه اضافه می کنیم، سپس پیازچه را می شوییم و به صورت ریز خرد می کنیم و به همراه سس ماهی، چیلی و آب ترب به کاسه اضافه می کنیم.\n" +
            "\n" + "مرحله چهارم\n" + "حالا مواد را به خوبی به مدت ۳ تا ۴ دقیقه ماساژ می دهیم تا ترب مزه دار شود، سپس مخلوط کیمچی را درون یک کاسه درب دار می ریزیم و درب آنرا می بندیم. در ادامه اجازه می دهیم کیمچی ترب تخمیر شود.\n" +
            "\n" + "مرحله پنجم\n" + "پس از گذشت ۲ روز درب ظرف را باز کرده و کیمچی را مخلوط می کنیم، سپس درون ظرف مورد نظرمان می ریزیم. در صورت تمایل می توانید کیمچی را تخمیر نشده و تازه به همراه پلو و سالاد سرو کنید. نوش جان.\n"
        ),
        Food(
            name = "نودل مرغ",
            foodCategoryId = 3,
            imageUrl = "https://chishi.ir/wp-content/uploads/2022/02/nodel-morgh.jpg",
            recipe = "نودل مرغ یکی از انواع غذاهای خوشمزه و ساده شرق آسیا است که به عنوان یک غذای خیلی فوری شناخته می شود، برای مشاهده آموزش کامل و مرحله به مرحله طرز تهیه نودل مرغ در ادامه با CookBook همراه باشید." +
            "\n" + "مرحله اول\n" + "برای تهیه نودل مرغ خوشمزه در ابتدای کار فیله های مرغ را به صورت تکه های کوچک خرد می کنیم، سپس یک تابه مناسب روی حرارت قرار داده و مقداری روغن اضافه می کنیم. در ادامه فیله های مرغ را به تابه اضافه می کنیم.\n" +
            "\n" + "مرحله دوم\n" + "فیله های مرغ را کمی تفت می دهیم تا تغییر رنگ دهند، سپس فلفل تند و پیاز را به صورت نگینی ریز خرد می کنیم و به تابه اضافه می کنیم. در ادامه پوست گوجه فرنگی ها را جدا کرده و آنها را به همراه سیر با رنده ریز رنده می کنیم.\n" +
            "\n" + "مرحله سوم\n" + "در این مرحله گوجه فرنگی و سیر رنده شده را به تابه اضافه می کنیم و به خوبی تفت می دهیم تا مواد با هم ترکیب شوند. در ادامه درب تابه را می گذاریم و اجازه می دهیم گوشت مرغ با آب سبزیجات به طور کامل بپزد.\n" +
            "\n" + "مرحله چهارم\n" + "در همین حین یک قابلمه مناسب را تا نیمه آب پر می کنیم و روی حرارت زیاد قرار می دهیم تا آب سریعتر به نقطه جوش برسد. پس از اینکه آب جوش امد، مقداری روغن و نمک به قابلمه اضافه کرده و کمی هم می زنیم.\n" +
            "\n" + "مرحله پنجم\n" + "در این مرحله نودل را به آب جوش اضافه می کنیم و اجازه می دهیم چند دقیقه درون آب جوش بماند تا نرم شود. توجه داشته باشید که زمان پخت نودل روی بسته بندی آن درج شده است و به طور معمول کمتر از ۱۰ دقیقه می باشد.\n" +
            "\n" + "مرحله ششم\n" + "حالا نودل را آبکشی کرده و اجازه می دهیم آب اضافی اش خارج شود، سپس آنرا به تابه حاوی مرغ اضافه می کنیم. در ادامه مواد را به خوبی ترکیب می کنیم و پس از گذشت ۵ دقیقه نودل را با ریحان تزیین کرده و سرو می کنیم.\n"
        ),
        Food(
            name = "سوکیاکی",
            foodCategoryId = 3,
            imageUrl = "https://mamifood.org/images/files/0000-11/138-75/95-min.jpg",
            recipe = "سوکیاکی همان طور که از نامش پیداست از گروه غذاهای آسیای جنوب شرقی بوده و مختص کشور ژاپن است؛ این غذا بی نهایت خوشمزه است تنها مشکلی که در تهیه آن دارید این است که پنیر توفو به سختی پیدا می شود؛ اگر در شهرهای بزرگ ایران زندگی می کنید احتمال یافتن این پنیر بیشتر است. پنیر توفو پنیری است قالبی که از شیر سویا به دست می آید این پنیر چربی کمی دارد ولی در عوض میزان آهن آن بسیار بالاست. این پنیر را تکه تکه ببرید و در انتها در کنار خوراک سوکیاکی قرار دهید. \n" +
                    "\n" +
                    "این غذا در زمره غذاهای رژیمی است، اگر وزن شما زیاد است و دچار کلسترول خون نیز هستید، مصرف سوکیاکی را فراموش نکنید. \n" +
            "\n" + "مرحله اول تهیه سوکیاکی:\n" + "ابتدا 3 قاشق غذاخوری روغن کنجد را داخل یک تابه بریزید و تابه را روی حرارت گاز بگذارید تا روغن گرم شود سپس 250 گرم گوشت قرمز ورقه ورقه شده را داخل روغن بی اندازید و با قاشق ورقه های گوشت را پشت و رو کنید تا رنگ آن ها کدر شود؛ کل محتویات تابه اعم از گوشت و روغن کنجد را داخل یک قابلمه بریزید و حرارت را کم کنید و یک لیتر آب گوشت را به آن اضافه نمایید. باید مهلت دهید تا گوشت ها نرم و پخته شوند. 50 دقیقه الی یک ساعت. \n" +
            "\n" + "مرحله دوم تهیه سوکیاکی:\n" + "یک عدد پیاز درشت را پوست بگیرید سپس پیاز را با چاقوی تیز ، پشت سر هم از عرض ببرید تا به شکل دایره دایره دربیاید. قارچ های درشت را هم بشویید و فقط از وسط دو نیمه کنید. سری به گوشت در حال پختن بزنید، اگر گوشت ها پخته شده بودند؛ 2 قاشق سوپخوری سس سویا را به آب گوشت اضافه کرده و هم بزنید؛ قارچ های دو نیمه شده، پیاز حلقه حلقه شده را هم به قابلمه اضافه نمایید و بگذارید پیاز و قارچ ها پخته شوند و آب گوشت را جذب کنند. \n" +
                    "نکته: برای چاشنی این غذا 2 قاشق سوپخوری سس سویا داشتیم که اضافه کرده ایم؛ خودتان مقداری از آب گوشت را بچشید اگر مزه آن به میلتان نبود، مقداری کمی نمک و فلفل به آن اضافه کنید. درب بسته نودل را هم باز کنید، معمولا داخل هر بسته نودل یک بسته چاشنی قرار داده اند آن را بیرون بیاورید و باز کنید و همه پودر چاشنی را داخل قابلمه در حال قل زدن بریزید(اگر طعم خوراک مناسب بود نیازی به این کار نیست).\n" +
            "\n" + "مرحله سوم تهیه سوکیاکی:\n" + "پس از اینکه از پختن گوشت، قارچ و پیاز راضی بودید(قارچ نباید بیش از حد پخته و له شود) حالا نوبت ریختن نودل است، در واقع نودل چون به مدت 5 دقیقه پخته می شود در آخرین مرحله پخت به غذا اضافه می شود. قالب نودل را از وسط نصف کنید و داخل قابلمه بی اندازید و درب قابلمه را ببندید تا نودل ها هم پخته شوند. \n" +
            "\n" + "مرحله چهارم تهیه سوکیاکی:\n" + "پس از پختن رشته های نودل؛ زیر گاز را خاموش کنید و محتویات درون قابلمه خوراک را با صبر و حوصله داخل یک ظرف مناسب بریزید. سپس با یک عدد زرده تخم مرغ خام که روی خوراک قرار می دهید، به همراه تکه های پنیر توفو  و هم چنین ساقه های کرفس خرد شده، سوکیاکی را تزیین کنید. نوش جان!\n" +
            "\n" + "نکته : \n" + "برای تهیه سوکیاکی همان طور که توضیح داده شد از گوشت قرمز ورقه شده استفاده می شود، سعی کنید از گوشت کمر یا ران گوساله که چربی کمتری دارد استفاده نمایید. کلسترول گوشت در چربی و ماهیچه های آن وجود دارد، بنابراین مصرف گوشت کم چرب و گرفتن چربی های گوشت به کاهش دریافت کلسترول شما کمک می کند. هنگام خرید گوشت بسته ایی که معمولا در فروشگاه های زنجیره ایی یافت می شوند، بسته هایی را بردارید که دارای کمترین میزان چربی است. \n" +
            "\n" + "نکته : \n" + "سس سویا سسی شور مزه و تیره رنگ است. این سس مخصوص، معمولا مکمل غذاهای ژاپنی بوده و طعمی بی نظیر به غذاهایتان می دهد. در همین دستور آشپزی توضیح دادم که حتما میزان چاشنی سوکیاکی را  پس از ریختن سویا سس چک کنید، اگر احتیاج به اضافه کردن نمک و فلفل بود، این مواد را اضافه کنید در غیر این صورت ریختن آن ها ضرورتی ندارد.  زیاد نمک نخورید! همه مواد به صورت طبیعی دارای نمک هستند؛ به جای عادت نمک ریختن روی غذا از پودر سماق، گرد لیمو، خردل استفاده نمایید.   \n"
        ),
    )
}
